{
    "translations": {
        "nav": {
            "home": "Главная",
            "about": "Об о Мне",
            "resume": "Резюме",
            "works": "Работы"
        },

        "home": {
            "title": "Данил Максимов",
            "introduction": "<span>Full Stack</span> разработчик, проживающий в городе Брно, Чехия. Вы можете узнать больше информации обо мне в моём резюме написанного при помощи фрэймворка <span>React</span>"
        },
        "about": {
            "title": "Об о Мне",
            "intro": "Меня зовут Данил, я являюсь Full Stack разработчиком из России, но в данный момент проживающий в Чехии. Я бывший студент Информационных Технологий при Техническом Университете города Брно и в данный момент являюсь практиком в разработке.\nЯ занимаюсь разработкой с начала 2019 года. Я верю, что разработка по большей части о решении задач/проблем, а написание кода лишь действие заднего плана, так что язык программирования это всего лишь инструмент для решения опредленных задач. На основе знаний программной инженерии, которые я получил в Университете, я стараюсь писать чистый и реюзабельный код, который легко поддерживать.\nЗа последний год я спроектировал, разработал и развернул множество различных проектов, начиная от проектов для автоматизации ежедневных задач и заканчивая проектами полноценными SPA проектами.\n В данный момент я являюсь Full Stack разрабочиком в компании Disivo, Брно где я занимаюсб разрабаткой нового функционала, рефакторингом легаси модулей и оптимищацией проекта используя такие технологии как Ruby on Rails и Vue.js",
            "contacts": {
                "title":"Контактные Данные",
                "content":"Данил Максимов\nБрно, Чешская Республика\ndanil.maximov2000@gmail.com\n+420 608 129 798"
            },
            "resume":"Скачать Английское CV"
        },
        "resume":{
            "education": {
                "title": "Образование",
                "university":{
                    "title": "Технический Университет в Брно", 
                    "status": "Студент факультета Информационных Технологий",
                    "graduateDate": "Май 2022"
                },
                "school": {
                    "title": "Гимназия 11 – Самара, Россия",
                    "status": "Диплом о среднем образовании", 
                    "graduateDate": "Май 2018"
                }
            },
            "experience": {
                "title": "Опыт",
                "university": {
                    "title": "Университет",
                    "position": "Разработчик Си",
                    "range": "Май 2019 - Декабрь 2019",
                    "intro": "Познакомился с основами программирования в статическом языке программирования Си. Было написано несколько проектов, в том числе университетских. Познакомился с программной инженерией, в частности с жизненным циклом ПО, этапами разработки ПО, анализом требований, спецификацией требований и с методолигиями разработки."
                },
                "backend":{
                    "title": "Фриланс - Back End",
                    "position": "Backend разработчик",
                    "range": "Январь 2020 - Июнь 2020",
                    "intro": "Разработал несколько приложений на основе языка Ruby. Познакомился с ООП включая SOLID, DRY, KISS и YAGNI принципами вместе с Шаблонами Проектирования. Спроектировал, разработал и развернул мультинациональный Телеграм Бот с высокой нагрузкой (возможно 12 тыс. пользовательских запросов в секунду). Разработан на основе требований клиента с более расширенным функционалом по сравнению с тем, что требовалось изначально. "
                },
                "fullstack":{
                    "title": "Фриланс - Full Stack",
                    "position": "Fullstack разработчик",
                    "range": "Июль 2020 - Октябрь 2020",
                    "intro": "Поддержка и Рефакторинг прошлых проектов. Работал над различными проектами, разрабатывая, как серверную часть web-приложений, так и клиентскую. Стек технологий, который применялся: Ruby on Rails (REST/GraphQL API's), ElasticSearch, RSpec, dry-rb, sidekiq, React (функциональщина, ну там хуки и тд), Redux( асинхронные запросы через Saga), Axios."
                },
                "disivo":{
                    "title": "Disivo",
                    "position": "Fullstack разработчик",
                    "range": "Ноябрь 2020 - По настоящее время",
                    "intro": "Разработка, поддержка и масштабирование платформы для управления и оптимизации цен для средних и крупных интернет-магазинов, включая расширение REST API в рамках Ruby on Rails, а также разработка клиентской части с использованием Vue.js\n"
                }
            },
            "skills":{
                "title": "Навыки",
                "languages": {
                    "title": "Языки Программирования",
                    "content": "Ruby; JavaScript; C"
                },

                "tools": {
                    "title": "Инструменты",
                    "content": "Ruby on Rails, RSpec, dry-rb, ElasticSearch; ORM (ActiveRecorder, Sequel); HTML5, CSS3, Bootstrap; React, Vue.js, Redux, Axios; Git, Heroku, Linux"
                },
                "technologies":{
                    "title": "Технологии",
                   "content": "Object-Oriented Programming; Design Patterns by GoF; SOLID, DRY, KISS, YAGNI, TDA principles; Functional Programming; Test-Driven Development; Cloud Computing; REST, GraphQL"
                }

            }
        },
        "works": {
            "title": "Посмотрите некоторые из моих работ",
            "heading": "Посмотрите некоторые из моих работ",
            "telegram": {
                "role": "Ruby Разработчик",
                "title": "Exam Doc's Bot",
                "content": "Мультинациональный Телеграм Бот с высокой нагрузкой (возможно 12 тыс. пользовательских запросов в секунду). Разработан на основе требований клиента с более расширенным функционалом по сравнению с тем, что требовалось изначально.",
                "technologies": "Ruby, Telegram API, VK API, Sequel(ORM), RSpec"
            },
            "webScraper": {
                "role": "Full Stack Разработчик",
                "title": "Web Scraper",
                "content": "Минималистичные, Крупномасштабный Web Scraper с широким функционал разработанный для считыванния данных с сайтов любого типа",
                "technologies": "Ruby on Rails, ElasticSearch, REST API, React, Redux, Axios"
            },
            "miniProjects": {
                "role": "Front End Разработчик",
                "title": "mini-projects-js",
                "content": "Здесь были реализованы различные проекты, для разработки которых использовался чистый JavaScript вместе с HTML5 и CSS3 без каких либо библиотек или фрэймворков.",
                "technologies": "JavaScript, CSS, HTML"
            },
            "skamvut": {
                "role": "Back End Разработчик / Ruby Разработчик",
                "title": "accommodation bot",
                "content": "Приватный телеграм бот на основе технологии Ruby on Rails для студентов, проживающих в общежитиях Технического Университета в Брно. Предоставляет удобный доступ к базе данных проживающих в общежитиях стуендтов. База данных формируется за счет POST запросов на информационную систему общежития, к кторой есть доступ только у студентов.",
                "technologies": "REST, Ruby on Rails, Telegram API, PostgreSQL"
            }
        }
    }
}